---
kind: property
id: P:Autodesk.Revit.DB.Electrical.ElectricalSetting.CircuitNamePhaseB
source: html/3036634e-8530-fac4-8f76-d08e662ad858.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalSetting.CircuitNamePhaseB Property

Circuit Naming by Phase - Phase B Label.

## Syntax (C#)
```csharp
public string CircuitNamePhaseB { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null